In [1]:
import numpy as np
import pandas as pd
import os
os.chdir('C:\\Users\\G634583\\OneDrive - General Mills\\Desktop\\Rohit\\Test')

In [2]:
df = pd.read_excel('Split_Rows_Data.xlsx')

In [3]:
df.head()

   Id                           City
0   1     Mumbai, New Delhi, Lucknow
1   2   Chicago, Michigan, Las Vegas
2   3  Brussels, Amsterdam, Bulgaria
3   4         Niger, Pretoria, Cairo

In [9]:
df_new = pd.concat([pd.Series(row['Id'], row['City'].split(', '))
          for _, row in df.iterrows()]).reset_index()

In [16]:
df_new.rename(columns={0:'Id','index':'Cities'}, inplace=True)

In [17]:
df_new.head()

      Cities  Id
0     Mumbai   1
1  New Delhi   1
2    Lucknow   1
3    Chicago   2
4   Michigan   2